In [1]:
import pandas as pd

In [6]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

nomes_m

In [7]:
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [8]:
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [10]:
print('Quantidade de nomes: ' + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [11]:
frames = [nomes_f, nomes_m] #juntando frames

In [30]:
nomes = pd.concat(frames)['nome'].to_frame() #juntando frames

In [17]:
nomes.sample(5) # mostra 5 nomes aleatorios

         nome
128     JOICE
24      FABIO
188  VALDECIR
77      ELIAS
84     FATIMA

## Incluindo ID dos alunos

In [18]:
import numpy as np

In [19]:
np.random.seed(123)

In [20]:
total_alunos = len(nomes)
total_alunos

400

In [22]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [23]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [24]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [25]:
nomes

          nome  id_aluno                 dominio
0        MARIA       235  @dominiodoemail.com.br
1          ANA        43     @servicodoemail.com
2    FRANCISCA       304     @servicodoemail.com
3      ANTONIA       156  @dominiodoemail.com.br
4      ADRIANA       343     @servicodoemail.com
..         ...       ...                     ...
195     WALTER       231  @dominiodoemail.com.br
196    ARLINDO        99     @servicodoemail.com
197    MICHAEL       323  @dominiodoemail.com.br
198     ALVARO       383  @dominiodoemail.com.br
199    GEOVANE       366     @servicodoemail.com

[400 rows x 3 columns]

In [28]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [29]:
nomes.sample(5)

       nome  id_aluno                 dominio                         email
114  ARTHUR       320  @dominiodoemail.com.br  arthur@dominiodoemail.com.br
57   DAIANE       303     @servicodoemail.com     daiane@servicodoemail.com
85   HELENA       221  @dominiodoemail.com.br  helena@dominiodoemail.com.br
183   IRACI         8  @dominiodoemail.com.br   iraci@dominiodoemail.com.br
189   DALVA       137  @dominiodoemail.com.br   dalva@dominiodoemail.com.br

## Criando a Tabela Cursos